tap "derailed/k9s"
tap "valkyrie00/bbrew"
brew "antidote"
brew "eza"
brew "fzf"
brew "gh"
brew "git-delta"
brew "kubernetes-cli"
brew "lazygit"
brew "neovim"
brew "thefuck"
brew "yadm"
brew "yazi"
brew "zoxide"
brew "derailed/k9s/k9s"
brew "valkyrie00/bbrew/bbrew"
cask "flashspace"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "karabiner-elements"
cask "pearcleaner"
cask "zen"
