tap "derailed/k9s"
tap "lihaoyun6/tap"
tap "pear-devs/pear"
tap "valkyrie00/bbrew"
brew "antidote"
brew "node"
brew "bitwarden-cli"
brew "btop"
brew "eza"
brew "fd"
brew "ffmpeg-full", link: true
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git-delta"
brew "imagemagick-full", link: true
brew "jq"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "pnpm"
brew "poppler"
brew "resvg"
brew "ripgrep"
brew "sevenzip"
brew "thefuck"
brew "uv"
brew "yadm"
brew "yazi"
brew "zoxide"
brew "derailed/k9s/k9s"
brew "valkyrie00/bbrew/bbrew"
cask "lihaoyun6/tap/airbattery"
cask "codex"
cask "flashspace"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "karabiner-elements"
cask "obsidian"
cask "orbstack"
cask "pear-devs/pear/pear-desktop"
cask "pearcleaner"
cask "rectangle"
cask "shottr"
cask "tablepro"
cask "zen"
uv "pre-commit"
