# Handle OMZ dependencies
getantidote/use-omz
ohmyzsh/ohmyzsh path:lib

# Load OMZ plugins
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/gcloud

# Theme
romkatv/powerlevel10k

# Plugins
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting
jeffreytse/zsh-vi-mode
